// hoisting არის როცა ჩვენ დავწერთ ფუნქციას და შემდეგ შევქმნით ცვლადს ეს ცუდია რადგან კოდის წსრიგი ირღვევა და უფრო რთულია კომპიუტერისთვის ან თვითონ მწერალისთვის

console.log(sum)

let sum = 10

console.log(num)

const num = 8

// var – ძველია, ცვლადიც იცვლება, ხელახლაც შეიძლება გამოცხადება.
// let – ახალია, იცვლება, მაგრამ ხელახლა გამოცხადება არ შეიძლება.
// const – არ იცვლება საერთოდ (გარდა ობიექტის შიგთავსისა).

// function expression - ფუნქცია ინახება ცვლადში როგორც მნიშვნელობა. ანუ ფუნქცია იქმნება და ენიჭება ცვლადს.

function greet() {
  console.log("Hello!");
}
greet();

// ცვლადის დაწერის გარეშე function expression ჯერ უნდა შეიქმნას ცვლადი და შემდეგ იმუშავებს

sayHi(); 

function sayHi() {
  console.log("Hi there!");
}
